/*****************************************************************
 *	@file			Kimura.cpp
 *	@brief			キムラシーン実装
 *	@author			井上颯騎
 *	@date			2019/07/29
 *****************************************************************/

//! INCLUDE
#include	"Kimura.h"


/*****************************************************************
 * @fn
 * 引数なしコンストラクタ
 * @param なし
 * @return なし
 *****************************************************************/
CKimura::CKimura() :
CSceneBase() {
}

/*****************************************************************
 * @fn
 * 引数なしデストラクタ
 * @param なし
 * @return なし
 *****************************************************************/
CKimura::~CKimura() {
	Release();
}

/*****************************************************************
 * @fn
 * 必要な素材の読み込み
 * @param なし
 * @return なし
 *****************************************************************/
bool CKimura::Load() {
	
	//m_BackTexture.Load("TestKimura.png");
	return TRUE;
}

/*****************************************************************
 * @fn
 * 初期化
 * @param なし
 * @return なし
 *****************************************************************/
void CKimura::Initialize() {


	Load();

	m_NextSceneNo = SCENENO_GAME;

	//m_Effect = { 255,0,0 };

	//m_Player.Load();

	m_Player.Initialize();

}

/*****************************************************************
 * @fn
 * 更新
 * @param なし
 * @return なし
 *****************************************************************/
void CKimura::Update() {

	//EffectUpdate(EFFECTNO_1);

	if (g_pInput->GetGamePadCount()) {

		if (g_pGamePad->IsKeyPush(GAMEKEY_B)) {

			m_NextSceneNo = SCENENO_GAMECLEAR;

		}
	}

	m_Player.Update();

}

/*****************************************************************
 * @fn
 * 描画
 * @param なし
 * @return なし
 *****************************************************************/
void CKimura::Render() {

	//m_BackTexture.Render(0, 0, MOF_ARGB(m_Effect.Alpha, 255, 255, 255));

	//EffectRender(EFFECTNO_1);

	//m_Player.Render();

}

/*****************************************************************
 * @fn
 * デバッグ描画
 * @param なし
 * @return なし
 *****************************************************************/
void CKimura::RenderDebug() {

	CGraphicsUtilities::RenderString(0, 0, MOF_XRGB(255,0,0),"KimuraScene Bボタンで画面遷移");

}

/*****************************************************************
 * @fn
 * 解放
 * @param なし
 * @return なし
 *****************************************************************/
void CKimura::Release() {

	m_Player.Release();

}